# task_2
#Найдите сумму цифр трехзначного числа.

n = int(input("Введите трехзначное число: "))
res = n // 100 + n % 100 // 10 + n % 10 
print(res)


# task_4
""" Петя, Катя и Сережа делают из бумаги журавликов. Вместеони сделали S журавликов. Сколько журавликов сделал каждый ребенок, если известно, 
что Петя и Сережа сделали одинаковоеколичество журавликов, а Катя сделала в два раза больше журавликов,чем Петя и Сережа вместе?"""


# task_6
""" Вы пользуетесь общественным транспортом? Вероятно, вы расплачивались за проезд и получали билет с номером. 
Счастливым билетом называют такой билет с шестизначным номером, где сумма первых трех цифр равна сумме последних трех. 
Т.е. билет с номером385916 – счастливый, т.к. 3+8+5=9+1+6. Вам требуется написатьпрограмму, которая проверяет счастливость билета."""


# task_8
"""Требуется определить, можно ли от шоколадки размером n× m долек отломить k долек, если разрешается сделать один разлом по
прямой между дольками (то есть разломить шоколадку на двапрямоугольника)."""


